bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
/**@brief GATT module event handler.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.",
                     p_evt->conn_handle,
                     p_evt->params.att_mtu_effective);
    }

    ble_hrs_on_gatt_evt(&m_hrs, p_evt);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}



void Handle_info(uint8_t *data, uint32_t data_len)
{
//	T_UartSendInfo Framedatainfo;
	
	
	unsigned int outlen;
	uint8_t *preply_data;
	uint8_t tmpdata[150];
	uint32_t ret;
	preply_data = tmpdata;
	
	NRF_LOG_INFO("\nHandle_info_function:[Before] ingeek_push_info:status:ingeek_get_sec_status is %x.if 0xFF, it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nreturn:ingeek_push_info(data, data_len) status is %x.if 0,it is right\n",ingeek_push_info(data, data_len));
	NRF_LOG_INFO("\nHandle_info_function:[After] ingeek_push_info:status:ingeek_get_sec_status is %x.if 0,it is right\n",ingeek_get_sec_status());
	
	#if 1
	if(ingeek_push_info(data, data_len) != SUCCESS){
		NRF_LOG_INFO("error:ingeek_push_info Not Success.");
		return ;
	  }
	  else{
		  if(ingeek_get_sec_status() == CARINFO_VALID){
				NRF_LOG_INFO("ingeek_get_sec_status is CARINFO_VALID.");
			if(ingeek_pull_info(preply_data, &outlen) != SUCCESS){
				NRF_LOG_INFO("error:ingeek_pull_info Not Success.");
				return;
			}
			else{
				if((outlen != 29) ){
					NRF_LOG_INFO("error:outlen != 29.");
					return;
				}
			}
		}
		if(ingeek_get_sec_status() != READ_INFO){
			return;
		}
		else{
			NRF_LOG_INFO("info is ok ,ingeek_pull_info,preply_data:\n");
			NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
		}
	  }
		#endif
}
void Handle_auth(uint8_t *data, uint32_t data_len)
{
	NRF_LOG_INFO("\nHandle_auth_function:[Before] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 1,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_auth_function,return:ingeek_push_auth %x, if 0,it is right\n",ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1));
	NRF_LOG_INFO("\nHandle_auth_function:[After] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	
	
	//T_UartSendAuth Framedataauth;
//	if(ingeek_get_sec_status() == READ_INFO){
//		if(ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1) != 0x0000){
//		return;
//		}	
//		else{
////		Framedataauth.Header = 0x7E;
////		Framedataauth.Address = 0x10;
////		Framedataauth.Operate = 0x0210;
////		Framedataauth.UUID = 0xF1FF;
////		Framedataauth.Datalength = 0x01;
////		Framedataauth.dataload[0] = 0x02;
////		Framedataauth.FCS0 = 0xFF;	
////		Framedataauth.FCS1 = 0xFF;
////		Uart3Sent(&Framedataauth,(Framedataauth.Datalength)+9);
//			NRF_LOG_INFO("auth is ok ,ingeek_push_auth");
//		}
//	}
}

void Handle_session(uint8_t *data, uint32_t data_len)
{
	//T_UartSendSession FramedataSession;
	unsigned int outlen;
	uint8_t *preply_data;
	//preply_data = gDataload;
	NRF_LOG_INFO("\nHandle_session_function:[Before] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_session_function,return:ingeek_push_auth %x, if 0,it is right\n",ingeek_push_session(data, data_len, preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_session_function:[After] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	
	NRF_LOG_INFO("\nHandle_session is ok ,ingeek_push_session,preply_data:\n");
	NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	
//	if(ingeek_get_sec_status() == WRITE_AUTH){
//	ingeek_push_session(data, data_len, preply_data, &outlen);
//	if(ingeek_get_sec_status() != WRITE_SESSION){
//	 return;
//	 }
//	 else{
//		 if(outlen != 112){
//			 return;
//		 }
//		 else{
////			 FramedataSession.Header = 0x7E;
////			 FramedataSession.Address = 0x10;
////			 FramedataSession.Operate = 0x0210;
////			 FramedataSession.UUID = 0xF4FF;
////			 FramedataSession.Datalength = (uint8_t)outlen+1;
////			 FramedataSession.dataload[0] = WRITE_SESSION;
////			 memcpy(&(FramedataSession.dataload[1]),preply_data,outlen);
////			 FramedataSession.FCS0 = 0xFF;
////			 FramedataSession.FCS1 = 0xFF;
////			 Uart3Sent(&FramedataSession,FramedataSession.Datalength+9);
//		 }
//	 }
//	}
}
	 
void Handle_cmd(uint8_t *data, uint32_t data_len)
{
//	T_UartSendCmd FramedataCmd;
	uint8_t *preply_data;
	unsigned int outlen;
	

	DK_Cmd_Meg struct_cmd;
	uint8_t cmd;

//	preply_data = gDataload;
	NRF_LOG_INFO("\nHandle_cmd_function:[Before] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_input_action %x, if 0,it is right\n",ingeek_command_input_action(data, data_len, &struct_cmd));
	NRF_LOG_INFO("\nHandle_cmd_function:[After] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_cmd_function: %x \n",(uint8_t)(struct_cmd.command));
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_output_action %x, if 0,it is right\n",ingeek_command_output_action(&struct_cmd,preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_cmd is ok ,ingeek_command_input_action,preply_data:\n");
	//NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	
	
//	if(ingeek_command_input_action(data, data_len, &struct_cmd) == 0x0000){
////	cmd = (uint8_t)(struct_cmd.command);
////	Uart3Sent(&cmd,1);  
////	MslCANSentFromSDK(cmd);	
//	
//	if(ingeek_command_output_action(&struct_cmd,preply_data, &outlen) != SUCCESS){
//		return;
//	}
//	else{
//		if(outlen != 16){
//			return;
//		}
//		else{
////			FramedataCmd.Header = 0x7E;
////			FramedataCmd.Address = 0x10;
////			FramedataCmd.Operate = 0x0210;
////			FramedataCmd.UUID = 0xF5FF;
////			FramedataCmd.Datalength = outlen;
////			FramedataCmd.FCS0 = 0xFF;
////			FramedataCmd.FCS1 = 0xFF;
////			memcpy(FramedataCmd.dataload,preply_data,outlen);
////			Uart3Sent(&FramedataCmd,FramedataCmd.Datalength+9); 
//		}
//	}			
//}
}
void ble_hrs_evt_handler (ble_hrs_t * p_hrs, ble_hrs_evt_t * p_evt){
	switch(p_evt->evt_type)
	{
		case BLE_DIGITAKKEY_EVT_INFO:
		{
//			for(uint16_t i=0;i<p_evt->params.rx_data.length;i++){
//			NRF_LOG_INFO("p_evt->params.rx_data.p_data %x",p_evt->params.rx_data.p_data[i]);
//			}

			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_INFO function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_info((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			ikcmdSendUart(*p_evt->params.rx_data.p_data);

			break;
		}
		case BLE_DIGITAKKEY_EVT_AUTH:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_AUTH function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_auth((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_SESSION:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_SESSION function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_session((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_CMD:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_CMD function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_RSSI:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_RSSI function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			//Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_VERSION:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_VERSION function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			//Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		default:
			NRF_LOG_INFO("This is ble_hrs_evt_handler function add lifei 2018/11/2 17:18.");
			break;
	}
	
